---
kind: enumMember
id: F:Autodesk.Revit.UI.PostableCommand.SplitWithGap
enum: Autodesk.Revit.UI.PostableCommand
source: html/f6ccdc1b-6ac3-9c49-d0bb-8a7d1877eab0.htm
---
# Autodesk.Revit.UI.PostableCommand.SplitWithGap

Splits a wall, pipe, duct, cable tray, conduit, structural framing or a column into 2 segments with a defined gap.